config.org
#+TITLE: Emacs Config
#+PROPERTY: header-args:elisp :results silent :tangle init.el

* Emacs
** Use-Package
#+begin_src elisp
  (use-package emacs
    :custom
    (create-lockfiles nil)
    (make-backup-files nil)
    (inhibit-splash-screen t)
    (initial-scratch-message "All systems go! 🚀")
    (initial-major-mode 'text-mode))
#+end_src

* Straight
https://github.com/radian-software/straight.el

** Pre-Bootstrap
#+begin_src elisp :tangle early-init.el
  (setq package-enable-at-startup nil)
  (setq straight-fix-flycheck t)
#+end_src

** Bootstrap
#+begin_src elisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name
	  "straight/repos/straight.el/bootstrap.el"
	  (or (bound-and-true-p straight-base-dir)
	      user-emacs-directory)))
	(bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

** Post-Bootstrap
#+begin_src elisp
  (setq straight-use-package-by-default t)
#+end_src

* Org Mode
** Use-Package
#+begin_src elisp
  (use-package org
    :defer t
    :custom
    (org-confirm-babel-evaluate nil)
    (org-src-window-setup 'split-window-below)
    (org-startup-indented t)
    (org-startup-with-inline-images t))
#+end_src

* Magit
https://magit.vc/

** Use-Package
#+begin_src elisp
  (use-package magit
    :bind
    (("C-c g" . magit-file-dispatch)))
#+end_src

* Vertico
https://github.com/minad/vertico

** Use-Package
#+begin_src elisp
  (use-package vertico
    :config
    (vertico-mode))
#+end_src

* Savehist
Persist completion history.

** Use-Package
#+begin_src elisp
  (use-package savehist
    :config
    (savehist-mode))
#+end_src

* Orderless
https://github.com/oantolin/orderless

** Use-Package
#+begin_src elisp
  (use-package orderless
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles partial-completion)))))
#+end_src

* Consult
https://github.com/minad/consult

** Use-Package
#+begin_src elisp
  (use-package consult
    :bind
    (("C-x b" . consult-buffer)
     ("C-x 4 b" . consult-buffer-other-window)
     ("C-x 5 b" . consult-buffer-other-frame)
     ("C-x p b" . consult-project-buffer)
     ("M-g M-g" . consult-goto-line)
     ("M-g o" . consult-outline)
     ("M-s r" . consult-ripgrep)
     ("M-s l" . consult-line)
     ("M-s k" . consult-keep-lines)
     ("M-s f" . consult-focus-lines)))
#+end_src

* Ace-Window
https://github.com/abo-abo/ace-window

** Use-Package
#+begin_src elisp
  (use-package ace-window
    :custom
    (aw-keys '(?a ?s ?d ?f ?g ?h ?k ?l))
    (aw-scope 'global)
    :bind
    (("M-o" . ace-window)))
#+end_src

* Avy
https://github.com/abo-abo/avy

** Embark Actions
#+begin_src elisp
  (defun my-avy-embark (point)
    (goto-char point)
    (embark-act))

  (defun my-avy-embark-dwim (point)
    (goto-char point)
    (embark-dwim))
#+end_src

** Use-Package
#+begin_src elisp
  (use-package avy
    :custom
    (avy-single-candidate-jump t)
    :config
    (setf (alist-get ?. avy-dispatch-alist) 'my-avy-embark)
    (setf (alist-get ?\; avy-dispatch-alist) 'my-avy-embark-dwim)
    :bind
    (("C-;" . avy-goto-char-timer)
     ("M-;" . avy-pop-mark)
     ("M-g g" . avy-goto-line)
     ("M-g G" . avy-goto-end-of-line)
     ("M-g h" . avy-org-goto-heading-timer)
     ("M-g s" . avy-goto-subword-1)
     :map isearch-mode-map
     ("C-;" . avy-isearch)))
#+end_src

* Embark
https://github.com/oantolin/embark

** Use-Package
#+begin_src elisp
  (use-package embark
    :bind
    (("C-." . embark-act)
     ("M-." . embark-dwim)))
#+end_src

* Embark-Consult
https://github.com/oantolin/embark/blob/master/embark-consult.el

** Use-Package
#+begin_src elisp
  (use-package embark-consult
    :after (embark consult))
#+end_src

* Link-Hint
https://github.com/noctuid/link-hint.el

** Use-Package
#+begin_src elisp
  (use-package link-hint
    :bind
    (("C-c f" . link-hint-open-link)
     ("C-c y" . link-hint-copy-link)))
#+end_src

* Crux
https://github.com/bbatsov/crux

** Use-Package
#+begin_src elisp
  (use-package crux
    :bind
    (("C-o" . crux-smart-open-line)
     ("C-S-o" . crux-smart-open-line-above)
     ("C-^" . crux-top-join-line)
     ("C-M-; D" . crux-duplicate-and-comment-current-line-or-region)))
#+end_src

* Whole-Line-or-Region
https://github.com/purcell/whole-line-or-region

** Use-Package
#+begin_src elisp
  (use-package whole-line-or-region
    :demand
    :config
    (whole-line-or-region-global-mode)
    :bind
    (("M-/" . whole-line-or-region-comment-dwim)))
#+end_src

* Smartparens
https://github.com/Fuco1/smartparens

** Use-Package
#+begin_src elisp
  (use-package smartparens
    :hook
    (prog-mode . smartparens-mode)
    :config
    (require 'smartparens-config)
    :bind
    (:map smartparens-mode-map
  	("C-<right>" . sp-forward-slurp-sexp)
  	("C-<left>" . sp-backward-slurp-sexp)
  	("M-<right>" . sp-forward-barf-sexp)
  	("M-<left>" . sp-backward-barf-sexp)
  	("M-a" . sp-beginning-of-sexp)
  	("M-e" . sp-end-of-sexp)
  	("C-M-u" . sp-up-sexp)
  	("C-M-S-u" . sp-backward-up-sexp)
  	("C-M-d" . sp-down-sexp)
  	("C-M-S-d" . sp-backward-down-sexp)
  	("C-c p u" . sp-unwrap-sexp)
  	("C-c p (" . sp-wrap-round)
  	("C-c p [" . sp-wrap-square)
  	("C-c p {" . sp-wrap-curly)
  	("C-c p r" . sp-rewrap-sexp)))
#+end_src
